class Context:
    JOIN_CHANNEL_MESSAGE = u'''
🎉 به چالش روزانه  دلارسنج خوش آمدید!  

🏆 شرایط مسابقه:  
1️⃣ شما باید قیمت کلوز دلار امروز را پیش‌بینی کنید (بر اساس نرخ دهی کانال هریرود).  
2️⃣ زمان شرکت در مسابقه: از ساعت 10:00 صبح تا 12:00 ظهر.  
3️⃣ در پایان، نزدیک‌ترین پیش‌بینی‌ها برنده خواهند بود.

🔰شرکت در این مسابقه کاملا رایگان است 🔰

1️⃣ به دو نفر اول که نزدیک‌ترین پیش‌بینی را داشته باشند، هر کدام 5.000.000 تومان هدیه می‌گیرند! 💵✨
2️⃣ به یک نفر دیگر، از طریق قرعه‌کشی بین تمام شرکت‌کنندگان، 1,000,000 تومان جایزه می‌دهیم! 🎟💰

🌟 اسپانسر این چالش: بروکر معتبر بلک ولف  
💡 در بروکر بلک ولف، شما می‌توانید مظنه آب‌شده جهانی را تنها با 2 میلیون تومان شروع به معامله کنید.  
📈 این بازار که رفتاری مشابه دلار دارد، محبوب معامله‌گران حرفه‌ای است!  

🔹 ویژگی‌های بروکر بلک ولف:  
- تنها با 2 میلیون تومان شروع کنید!  
- کمیسیون هر معامله فقط **1,000 تومان**، یکی از رقابتی‌ترین کمیسیون‌ها!  
- همچنین در این اتاق معاملاتی علاوه بر مظنه ابشده جهانی متوانید ، انس ریالی و ارز دیجیتال هم معامله کنید 

🔮 برای شرکت در مسابقه، ابتدا باید عضو کانال بلک ولف شوید:
'''.strip()
    CHANNEL_JOIN_BUTTON = u'''
عضویت در کانال بلک ولف
'''.strip()
    JOINED_MESSAGE = u'''
عضو شدم ✅
'''.strip()
    JOIN_SUCCESSFUL = u'''
✅ شما عضو کانال هستید! حالا می‌توانید در مسابقه شرکت کنید.
'''.strip()
    JOIN_FAILED = u'''
❌ شما هنوز عضو کانال نیستید. عضویت در کانال اجباری است.
✅ لطفاً پس از عضویت دوباره تلاش کنید.
'''.strip()
    MAIN=u'''
🔮پیش بینی شما:
{p}
⏳ منتظر اعلام نتایج باشید!
'''
    MAIN_EMPTY=u'''
🔮 مسابقه پیش‌بینی کلوز بازار دلار!

💵 هدف مسابقه: پیش‌بینی  کلوز بازار دلار (بر اساس کانال هریرود).

⏰ زمان شرکت در مسابقه: 10:00 صبح تا 12:00 ظهر.
'''.strip()

    SEND_VALUE=u'''
📋 نمونه: 68020 (عدد 5 رقمی)
🔸 لطفاً پیش‌بینی خود را به‌صورت یک عدد 5 رقمی وارد کنید:
'''.strip()
    CHANGE_VALUE = u'''
تغییر پیشبینی
'''.strip()
    SET_VALUE = u'''
شرکت در مسابقه
'''.strip()
    UNVALID_RESULT=u'''
❌ عدد وارد شده صحیح نیست!

📋 لطفاً پیش‌بینی خود را به‌صورت عدد 5 رقمی وارد کنید.
📋 نمونه: 68020
'''.strip()
    OK = u'''
گرفتم ✅
'''.strip()
    RETRY = u'''
تلاش دوباره
'''.strip()
    RETURN = u'''
بازگشت
'''.strip()
    SET_VALUE_DONE=u'''
✅ پیش‌بینی شما ثبت شد: {p} دلار
اسامی برندگان هرروز در کانال بلک ولف قرار میگیرد
'''.strip()
    CHANNEL_LINK_BUTTON=u'''
کانال بلک ولف
'''.strip()
    PARTICIPATE_NOTALLOWED=u'''
⛔️ هم‌اکنون امکان ثبت پیش‌بینی وجود ندارد.

⏰ ساعت مجاز برای شرکت در مسابقه: 10:00 صبح تا 12:00 ظهر.

📋 لطفاً در بازه زمانی مشخص شده، پیش‌بینی خود را ثبت کنید.
'''.strip()
    PARTICIPATE=u'{t} - {v} 💵'

    TOOMANY_PARTICIPATE=u'''
پیشبینی قبول نشد
حداکثر یک پیش بینی در یک ساعت مجاز است
زمان باقیمانده: {t}
'''.strip()
    MAX_PARTICIPATE = u'''
پیشبینی قبول نشد
حداکثر پیشبینی مجاز 3 پیشبینی در روز است
زمان باقیمانده: {t}
'''.strip()
    ADMIN_MAIN = u'''
انتخاب کنید
'''.strip()
    FILTER_USER_BUTTON = u'''
انتخاب یوزر با پیشبینی
'''.strip()
    BROADCAST_BUTTON = u'''
ارسال به همه
'''.strip()
    FILTER_USER = u'''
قیمت را ارسال کنید
'''.strip()
    BROADCAST = u'''
پیام متنی مورد نظر را ارسال کنبد
'''.strip()
    FILTER_RESULT = u'''
{n} - @{un} - {v} - {t}
'''.strip()
    FILTER_RESULT_ALL = u'''
نتیجه:
{r}
'''.strip()
    REMINDER = u'''
⏰ مسابقه پیش‌بینی کلوز بازار دلار از ساعت 10:00 صبح آغاز می‌شود. آماده‌اید؟
'''.strip()
    END_GAME=u'''
⛔️ زمان شرکت در مسابقه به پایان رسید. منتظر نتایج باشید! 🏆
'''.strip()
    REPORT_BUTTON = u'''
گزارش
'''.strip()
    REPORT = u'''
آمار:
تعداد کل وارد شدگان به بات : {u}
نکنه: این تعداد یوزرهایی است که داخل کانال عضو شده اند، افراد تا زمانی که داخل ربات عضو نشوند داخل دیتابیس ذخیره نمیشوند
تعداد شرکت کنندگان امروز: {p}
میانگین پیشبینی امروز: {v}
'''