class Context:
    JOIN_CHANNEL_MESSAGE = '''
🎉 خوش آمدید به مسابقه پیش‌بینی!

🔮 برای شرکت در مسابقه، ابتدا باید عضو کانال زیر شوید:
'''
    JOINED_MESSAGE = '''
عضو شدم ✅
'''
    MAIN='''
🔮پیش بینی های شما:
{p}
'''
    MAIN_EMPTY='''
🔮 مسابقه پیش‌بینی قیمت مظنه طلا!

💵 قیمت مظنه طلا را برای 1 ساعت آینده پیش‌بینی کنید.
✅ پیش‌بینی صحیح = امتیاز بیشتر و شانس برنده شدن جوایز ویژه!
'''

    SEND_VALUE='''
📋 نمونه: 68020 (عدد 5 رقمی)
🔸 لطفاً پیش‌بینی خود را به‌صورت یک عدد 5 رقمی وارد کنید:
'''
    CHANGE_VALUE = '''
پیشبینی جدید
'''
    SET_VALUE = '''
شرکت در مسابقه
'''
    UNVALID_RESULT='''
جواب قابل قبول نیست لطفا نکات زیر را رعایت کنید:
جواب را به صورت یک عدد با حروف انگلیسی ارسال کنید
پاسخ نباید اعشاری باشد
پاسخ نباید از 10000000 بیشتر باشد
'''
    OK = '''
گرفتم
'''
    SET_VALUE_DONE='''
✅ پیش‌بینی شما ثبت شد: {p} دلار
'''
    PARTICIPATE_NOTALLOWED='''
پیش بینی  تنها قبل از ساعت 17 امکان پذیر است
'''
    PARTICIPATE='{t} - {v} 💵'