class Context:
    JOIN_CHANNEL_MESSAGE = u'''
🎉 به چالش روزانه  دلارسنج خوش آمدید!  

🏆 شرایط مسابقه:  
1️⃣ شما باید قیمت کلوز دلار امروز را پیش‌بینی کنید (بر اساس نرخ دهی کانال هریرود).  
2️⃣ زمان شرکت در مسابقه: از ساعت 10:00 صبح تا 12:00 ظهر.  
3️⃣ در پایان، نزدیک‌ترین پیش‌بینی‌ها برنده خواهند بود.

🔰شرکت در این مسابقه کاملا رایگان است 🔰

🔮 هر روز شانس برنده شدن داشته باشید!  
💵 با پیش‌بینی  قیمت دلار، جوایز ارزشمند بگیرید:  
1️⃣ به دو نفر اول که نزدیک‌ترین پیش‌بینی را داشته باشند، هر کدام 1,000,000 تومان هدیه می‌دهیم!  
2️⃣ به یک نفر دیگر، از طریق قرعه‌کشی بین تمام شرکت‌کنندگان، 1,000,000 تومان جایزه می‌دهیم!  

🌟 اسپانسر این چالش: بروکر معتبر بلک ولف  
💡 در بروکر بلک ولف، شما می‌توانید مظنه آب‌شده جهانی را تنها با 2 میلیون تومان شروع به معامله کنید.  
📈 این بازار که رفتاری مشابه دلار دارد، محبوب معامله‌گران حرفه‌ای است!  

🔹 ویژگی‌های بروکر بلک ولف:  
- تنها با 2 میلیون تومان شروع کنید!  
- کمیسیون هر معامله فقط **1,000 تومان**، یکی از رقابتی‌ترین کمیسیون‌ها!  
- همچنین در این اتاق معاملاتی علاوه بر مظنه ابشده جهانی متوانید ، انس ریالی و ارز دیجیتال هم معامله کنید 

🔮 برای شرکت در مسابقه، ابتدا باید عضو کانال بلک ولف شوید:
'''
    CHANNEL_JOIN_BUTTON = u'''
عضویت در کانال بلک ولف
'''
    JOINED_MESSAGE = u'''
عضو شدم ✅
'''
    JOIN_SUCCESSFUL = u'''
✅ شما عضو کانال هستید! حالا می‌توانید در مسابقه شرکت کنید.
'''
    JOIN_FAILED = u'''
❌ شما هنوز عضو کانال نیستید. عضویت در کانال اجباری است.
✅ لطفاً پس از عضویت دوباره تلاش کنید.
'''
    MAIN=u'''
🔮پیش بینی شما:
{p}
⏳ منتظر اعلام نتایج باشید!
'''
    MAIN_EMPTY=u'''
🔮 مسابقه پیش‌بینی کلوز بازار دلار!

💵 هدف مسابقه: پیش‌بینی  کلوز بازار دلار (بر اساس کانال هریرود).

⏰ زمان شرکت در مسابقه: 10:00 صبح تا 12:00 ظهر.
'''

    SEND_VALUE=u'''
📋 نمونه: 68020 (عدد 5 رقمی)
🔸 لطفاً پیش‌بینی خود را به‌صورت یک عدد 5 رقمی وارد کنید:
'''
    CHANGE_VALUE = u'''
تغییر پیشبینی
'''
    SET_VALUE = u'''
شرکت در مسابقه
'''
    UNVALID_RESULT=u'''
❌ عدد وارد شده صحیح نیست!

📋 لطفاً پیش‌بینی خود را به‌صورت عدد 5 رقمی وارد کنید.
📋 نمونه: 68020
'''
    OK = u'''
گرفتم ✅
'''
    RETRY = u'''
تلاش دوباره
'''
    RETURN = u'''
بازگشت
'''
    SET_VALUE_DONE=u'''
✅ پیش‌بینی شما ثبت شد: {p} دلار
'''
    PARTICIPATE_NOTALLOWED=u'''
⛔️ هم‌اکنون امکان ثبت پیش‌بینی وجود ندارد.

⏰ ساعت مجاز برای شرکت در مسابقه: 10:00 صبح تا 12:00 ظهر.

📋 لطفاً در بازه زمانی مشخص شده، پیش‌بینی خود را ثبت کنید.
'''
    PARTICIPATE=u'{t} - {v} 💵'

    TOOMANY_PARTICIPATE=u'''
پیشبینی قبول نشد
حداکثر یک پیش بینی در یک ساعت مجاز است
زمان باقیمانده: {t}
'''
    MAX_PARTICIPATE = u'''
پیشبینی قبول نشد
حداکثر پیشبینی مجاز 3 پیشبینی در روز است
زمان باقیمانده: {t}
'''
    ADMIN_MAIN = u'''
انتخاب کنید
'''
    FILTER_USER_BUTTON = u'''
انتخاب یوزر با پیشبینی
'''
    BROADCAST_BUTTON = u'''
ارسال به همه
'''
    FILTER_USER = u'''
قیمت را ارسال کنید
'''
    BROADCAST = u'''
پیام متنی مورد نظر را ارسال کنبد
'''
    FILTER_RESULT = u'''
{n} - @{un} - {v} - {t}
'''
    FILTER_RESULT_ALL = u'''
نتیجه:
{r}
'''
    REMINDER = u'''
⏰ مسابقه پیش‌بینی کلوز بازار دلار از ساعت 10:00 صبح آغاز می‌شود. آماده‌اید؟
'''
    END_GAME=u'''
⛔️ زمان شرکت در مسابقه به پایان رسید. منتظر نتایج باشید! 🏆
'''