class Context:
    JOIN_CHANNEL_MESSAGE = u'''
🎉 خوش آمدید به مسابقه پیش‌بینی!

🔮 برای شرکت در مسابقه، ابتدا باید عضو کانال زیر شوید:
'''
    JOINED_MESSAGE = u'''
عضو شدم ✅
'''
    MAIN=u'''
🔮پیش بینی های شما:
{p}
'''
    MAIN_EMPTY=u'''
🔮 مسابقه پیش‌بینی قیمت مظنه طلا!

💵 قیمت مظنه طلا را برای 1 ساعت آینده پیش‌بینی کنید.
✅ پیش‌بینی صحیح = امتیاز بیشتر و شانس برنده شدن جوایز ویژه!
'''

    SEND_VALUE=u'''
📋 نمونه: 68020 (عدد 5 رقمی)
🔸 لطفاً پیش‌بینی خود را به‌صورت یک عدد 5 رقمی وارد کنید:
'''
    CHANGE_VALUE = u'''
پیشبینی جدید
'''
    SET_VALUE = u'''
شرکت در مسابقه
'''
    UNVALID_RESULT=u'''
جواب قابل قبول نیست لطفا نکات زیر را رعایت کنید:
جواب را به صورت یک عدد با حروف انگلیسی ارسال کنید
پاسخ نباید اعشاری باشد
پاسخ نباید از 10000000 بیشتر باشد
'''
    OK = u'''
گرفتم
'''
    SET_VALUE_DONE=u'''
✅ پیش‌بینی شما ثبت شد: {p} دلار
'''
    PARTICIPATE_NOTALLOWED=u'''
پیش بینی  تنها قبل از ساعت 17 امکان پذیر است
'''
    PARTICIPATE=u'{t} - {v} 💵'

    TOOMANY_PARTICIPATE=u'''
پیشبینی قبول نشد
حداکثر یک پیش بینی در یک ساعت مجاز است
زمان باقیمانده: {t}
'''
    MAX_PARTICIPATE = u'''
پیشبینی قبول نشد
حداکثر پیشبینی مجاز 3 پیشبینی در روز است
زمان باقیمانده: {t}
'''