class Context:
    JOIN_CHANNEL_MESSAGE = '''
برای ورود به مسابقه داخل این کانال عضو شو
'''
    JOINED_MESSAGE = '''
عضو شدم
'''
    MAIN='''
پیش بینی شما:
{p}
'''
    MAIN_EMPTY='''
با پیشبینی رایگان قیمت دلار برنده جایزه شو
'''

    SEND_VALUE='''
پیش بینی خود را بفرستید
'''
    CHANGE_VALUE = '''
تغییر پیش بینی
'''
    SET_VALUE = '''
شرکت در مسابقه
'''
    UNVALID_RESULT='''
جواب قابل قبول نیست لطفا نکات زیر را رعایت کنید:
جواب را به صورت یک عدد با حروف انگلیسی ارسال کنید
پاسخ نباید اعشاری باشد
پاسخ نباید از 10000000 بیشتر باشد
'''
    OK = '''
گرفتم
'''
    SET_VALUE_DONE='''
پیش بینی شما ثبت شد
'''
    PARTICIPATE_NOTALLOWED='''
پیش بینی  تنها قبل از ساعت 17 امکان پذیر است
'''